"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [7, 5, 3, 3, 2]
pos = 0
n = int(input('Введите число: '))
if my_list.count(n) >= 1:
    my_list.insert(my_list.index(n), n)
else:
    for i in range(len(my_list)):
        if my_list[i] > n:
            pos = my_list.index(my_list[i]) + 1
    my_list.insert(pos, n)
print(f'Пользователь ввел число {n}.')
print(*my_list, sep=", ", end=".")
